In [1]:
import pandas as pd

In [4]:
dict1={"Name":['Usama','Ahmad','Hammad','Akbar','Ali','Zain','Abdullah','Subhan','Hussnain'],
      "Marks":[90,88,87,86,45,54,65,66,77],
      "Gender":["Male","Male","Male","Male","Male","Male","Male","Male","Male",]}
df1=pd.DataFrame(dict1)
df1

       Name  Marks Gender
0     Usama     90   Male
1     Ahmad     88   Male
2    Hammad     87   Male
3     Akbar     86   Male
4       Ali     45   Male
5      Zain     54   Male
6  Abdullah     65   Male
7    Subhan     66   Male
8  Hussnain     77   Male

# DIsplay Top 3 Rows

In [5]:
df1.head(3)

     Name  Marks Gender
0   Usama     90   Male
1   Ahmad     88   Male
2  Hammad     87   Male

# last 2 rows

In [6]:
df1.tail(2)

       Name  Marks Gender
7    Subhan     66   Male
8  Hussnain     77   Male

# Shape of DataFrame

In [8]:
df1.shape

(9, 3)

In [10]:
print('Number of rows',df1.shape[0])
print('Number of col',df1.shape[1])

Number of rows 9
Number of col 3

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Marks   9 non-null      int64
 2   Gender  9 non-null      object
dtypes: int64(1), object(2)
memory usage: 348.0+ bytes

In [15]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [17]:
df1.describe(include='all')

         Name      Marks Gender
count       9   9.000000      9
unique      9        NaN      1
top     Usama        NaN   Male
freq        1        NaN      9
mean      NaN  73.111111    NaN
std       NaN  16.404606    NaN
min       NaN  45.000000    NaN
25%       NaN  65.000000    NaN
50%       NaN  77.000000    NaN
75%       NaN  87.000000    NaN
max       NaN  90.000000    NaN

In [19]:
df1["Gender"].unique()

array(['Male'], dtype=object)

In [21]:
df1['Gender'].value_counts()

Gender
Male    9
Name: count, dtype: int64

In [24]:
df1[df1['Marks']>=90]

    Name  Marks Gender
0  Usama     90   Male

In [25]:
df1[(df1['Marks']>=90)   & (df1["Marks"]<=100)]

    Name  Marks Gender
0  Usama     90   Male

In [27]:
df1[df1['Marks'].between(80,100)]

     Name  Marks Gender
0   Usama     90   Male
1   Ahmad     88   Male
2  Hammad     87   Male
3   Akbar     86   Male

In [28]:
df1['Marks'].mean()

73.11111111111111

# Apply Method

In [36]:
def marks(x):
    return x//2

In [37]:
df1['Marks'].apply(marks)

0    45
1    44
2    43
3    43
4    22
5    27
6    32
7    33
8    38
Name: Marks, dtype: int64

In [38]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [39]:
df1

       Name  Marks Gender  Half_Marks
0     Usama     90   Male          45
1     Ahmad     88   Male          44
2    Hammad     87   Male          43
3     Akbar     86   Male          43
4       Ali     45   Male          22
5      Zain     54   Male          27
6  Abdullah     65   Male          32
7    Subhan     66   Male          33
8  Hussnain     77   Male          38

In [40]:
df1['Marks'].apply(lambda x:x/2)

0    45.0
1    44.0
2    43.5
3    43.0
4    22.5
5    27.0
6    32.5
7    33.0
8    38.5
Name: Marks, dtype: float64

In [42]:
df1["Gender"].map({'Male':1,'Female':0})

0    1
1    1
2    1
3    1
4    1
5    1
6    1
7    1
8    1
Name: Gender, dtype: int64

In [ ]:
df1